/**
 * @file   	BLEDS_board_leds.h
 * @author
 * @version
 * @date 	24 сент. 2018 г.
 * @brief
 */


#ifndef BLEDS_BOARD_LEDS_H_
#define BLEDS_BOARD_LEDS_H_


/*#### |Begin| --> Секция - "Include" ########################################*/
/*==== |Begin| --> Секция - "C libraries" ====================================*/
#include "stdint.h"
/*==== |End  | <-- Секция - "C libraries" ====================================*/

/*==== |Begin| --> Секция - "MK peripheral libraries" ========================*/
#include "stm32f1xx.h"
#include "stm32f1xx_ll_gpio.h"
#include "stm32f1xx_hal_gpio.h"
#include "stm32f1xx_ll_bus.h"
#include "stm32f1xx_hal_rcc.h"
/*==== |End  | <-- Секция - "MK peripheral libraries" ========================*/

/*==== |Begin| --> Секция - "Extern libraries" ===============================*/
/*==== |End  | <-- Секция - "Extern libraries" ===============================*/
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Определение констант" ###########################*/
/*#### |End  | <-- Секция - "Определение констант" ###########################*/


/*#### |Begin| --> Секция - "Определение типов" ##############################*/
/*#### |End  | <-- Секция - "Определение типов" ##############################*/


/*#### |Begin| --> Секция - "Определение глобальных переменных" ##############*/
/*#### |End  | <-- Секция - "Определение глобальных переменных" ##############*/


/*#### |Begin| --> Секция - "Прототипы глобальных функций" ###################*/
extern void
BLEDS_Init_AllLeds(
	void);

extern void
BLEDS_Green_ON(
	void);

extern void
BLEDS_Green_OFF(
	void);
/*#### |End  | <-- Секция - "Прототипы глобальных функций" ###################*/


/*#### |Begin| --> Секция - "Определение макросов" ###########################*/
/* TODO - Макрос для включения светодиода */
#define __BLEDS_Green_ON				()

/* TODO - Макрос для выключения светодиода */
#define __BLEDS_Green_OFF				()
/*#### |End  | <-- Секция - "Определение макросов" ###########################*/

#endif	/* BLEDS_BOARD_LEDS_H_ */

/*############################################################################*/
/*################################ END OF FILE ###############################*/
/*############################################################################*/
