/**
 * @file   	rcc.c
 * @author 	m.isaev
 * @version
 * @date 	18 сент. 2018 г.
 * @brief
 */


/*#### |Begin| --> Секция - "Include" ########################################*/
#include "rcc.h"
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Глобальные переменные" ##########################*/
/*#### |End  | <-- Секция - "Глобальные переменные" ##########################*/


/*#### |Begin| --> Секция - "Локальные переменные" ###########################*/
/*#### |End  | <-- Секция - "Локальные переменные" ###########################*/


/*#### |Begin| --> Секция - "Прототипы локальных функций" ####################*/
/*#### |End  | <-- Секция - "Прототипы локальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание глобальных функций" ####################*/
void
LL_RCC_Init_HSE_8MHz_HCLK_72MHz(
	void)
{
	LL_RCC_DeInit();;

	/* Установка задержки чтения Flash памяти */
	LL_FLASH_SetLatency(LL_FLASH_LATENCY_2);
	LL_FLASH_EnablePrefetch();

	/* Конфигурирование тактового генератора */
	LL_UTILS_PLLInitTypeDef	PLL_init_s;
	PLL_init_s.PLLMul = LL_RCC_PLL_MUL_9;
	PLL_init_s.Prediv = LL_RCC_PREDIV_DIV_1;

	LL_UTILS_ClkInitTypeDef CLK_init_s;
	CLK_init_s.AHBCLKDivider	= LL_RCC_SYSCLK_DIV_1;
	CLK_init_s.APB1CLKDivider	= LL_RCC_APB1_DIV_2;
	CLK_init_s.APB2CLKDivider	= LL_RCC_APB2_DIV_1;

	LL_PLL_ConfigSystemClock_HSE(
		HSE_VALUE,
		LL_UTILS_HSEBYPASS_OFF,
		&PLL_init_s,
		&CLK_init_s);
}
/*#### |End  | <-- Секция - "Описание глобальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание локальных функций" #####################*/
/*#### |End  | <-- Секция - "Описание локальных функций" #####################*/


/*############################################################################*/
/*############################ END OF FILE  ##################################*/
/*############################################################################*/
